{ "reportTitle": "BuildVision Project Report", "customerInformation": { "customerName": "Philadelphia Phillies", "contactPerson": "Ken Rienstra", "contactEmail": "krienstra@lfdriscoll.com", "contactPhone": "", "projectId": "20240795", "additionalFields": { "contractType": "Proposal", "requestType": "Proposal", "dateInvited": "5/15/2025", "dateDue": "5/28/2025" } }, "projectInformation": { "projectName": "Citizens Bank Park - Right Field Club", "location": "One Citizens Bank Way, Philadelphia, PA 19148", "startDate": "", "completionDate": "", "budget": "", "scope": "Furnish and install air-cooled rotary-screw water chiller for the Right Field Club renovation project, including all necessary accessories, controls, and vibration isolation as specified in technical specifications.", "projectUrl": "https://app.buildvision.io/admin/organizations/9474ffd3-66c9-4316-b45c-c71e80a1d3b4/package-projects/53e23006-b3ca-4dee-b92b-6aeb8923b69c/details", "additionalFields": { "architect": "EwingCole", "architectProjectNumber": "20240795", "engineerOfRecord": "EwingCole", "constructionManager": "LF Driscoll", "bidStatus": "BuildingConnected Lead", "projectPhase": "Bidding" } }, "preparerInformation": { "preparers": [ { "name": "Ben Lyddane", "email": "Ben@BuildVision.io", "phone": "202-365-8628" }, { "name": "Mackenzie Hoover", "email": "Mackenzie@buildvision.io", "phone": "843-609-3265" } ], "preparationDate": "5/15/2025" }, "equipmentByType": [ { "equipmentType": "Air-Cooled, Rotary-Screw Water Chiller", "notes": "Chiller shall operate using R-513A refrigerant. Unit shall include twin screw compressors, direct expansion type evaporator, air-cooled condenser, and integral pump module.", "items": [ { "equipmentTag": "CH-4", "manufacturer": "York", "model": "YVAA0456", "specifications": { "capacity": "350 tons", "evaporatorFlow": "700 GPM", "evaporatorPressureDrop": "13.2 ft WG", "evaporatorEnteringTemp": "55°F", "evaporatorLeavingTemp": "43°F", "waterConnSize": "8 inches", "numberOfCondFans": "24", "condenserFanHP": "2 HP each", "condenserEnteringAirTemp": "95°F", "numberOfCompressors": "2", "totalCompressorPower": "367.8 kW", "efficiencyRating": "1.05 kW/ton", "EER": "11.4", "refrigerantType": "R-513A", "electricalCharacteristics": "460V-3ph", "minimumCircuitAmpacity": "882.4", "vibrationIsolation": "FSNTL", "numberOfPumps": "2", "pumpFlow": "700 GPM", "pumpTotalHead": "75 ft WG", "pumpMotorHP": "25 HP each", "specialFeatures": "Unit mounted ultra low harmonic VFD (1 per compressor), suction shut-off service valve for each compressor, dual point power and unit controller, integral pump module with active/spare pumps and VFDs, dual point power connection, isolation valves on pump suction and discharge" } } ] } ], "suppliers": [ { "componentType": "Air-Cooled, Rotary-Screw Water Chiller", "suppliers": [ { "manufacturer": "York", "model": "YVAA0456", "isBasisOfDesign": true, "representativeInfo": { "name": "Gil-Bar Industries (JCI Rep)", "company": "Gil-Bar Industries", "contact": "Matt Neumann (NJ) / Joe Cohen (NY) / Ian Sorenson (NY)" }, "costDifference": "$0 (Basis of Design)", "compatibilityNotes": "Basis of design specified in project documents. Provides specified 350 ton capacity, energy efficiency of 1.05 kW/ton, and includes required features such as VFDs and integral pump module with dual pumps." } ] }, { "componentType": "Air-Cooled, Rotary-Screw Water Chiller (Alternatives)", "suppliers": [ { "manufacturer": "Trane", "model": "RTAC Series", "isBasisOfDesign": false, "representativeInfo": { "name": "Trane New York", "company": "Trane", "contact": "Diana Froelich" }, "costDifference": "TBD", "compatibilityNotes": "Helical rotary screw compressor technology with comparable efficiency ratings. Available with VFD options, dual refrigerant circuits, and can be configured with similar pump packages to match specifications." }, { "manufacturer": "Carrier", "model": "30XA Series", "isBasisOfDesign": false, "representativeInfo": { "name": "Carrier New York", "company": "Carrier", "contact": "Steve Handelman" }, "costDifference": "TBD", "compatibilityNotes": "AquaForce series offers similar capacity range and can be configured with VFDs and integrated hydronic packages to match specifications. Screw compressor technology with good part-load performance." }, { "manufacturer": "Daikin", "model": "AGZ Series", "isBasisOfDesign": false, "representativeInfo": { "name": "Daikin Applied", "company": "Daikin", "contact": "Pam Biehl" }, "costDifference": "TBD", "compatibilityNotes": "Pathfinder series offers high efficiency with VFD-driven screw compressors. Can be configured with similar pump packages and dual-circuit design for redundancy." }, { "manufacturer": "Aermec", "model": "NRB Series", "isBasisOfDesign": false, "representativeInfo": { "name": "Daniel Breit", "company": "Highmark", "contact": "Highmark New York" }, "costDifference": "TBD", "compatibilityNotes": "European manufacturer with growing US presence. NRB series offers high efficiency and quiet operation with screw compressors. Available with integrated hydronic packages." }, { "manufacturer": "McQuay/Daikin", "model": "AWS Series", "isBasisOfDesign": false, "representativeInfo": { "name": "Daikin Applied", "company": "Daikin", "contact": "Pam Biehl" }, "costDifference": "TBD", "compatibilityNotes": "AWS series offers good efficiency with semi-hermetic screw compressors. Available with VFD options and dual-circuit design for redundancy." } ] } ], "designNotes": [ { "systemType": "Air-Cooled Chiller System", "technicalObservations": [ "Chiller is specified with R-513A refrigerant, which is an environmentally-friendly HFO blend with a GWP of 631, significantly lower than traditional HFC refrigerants.", "The specified efficiency of 1.05 kW/ton exceeds ASHRAE 90.1 minimum requirements for this size air-cooled chiller.", "Dual pump configuration (one active, one spare) with VFDs provides N+1 redundancy and energy-efficient variable flow operation.", "Twin screw compressor design with dual refrigerant circuits enables excellent part-load efficiency and redundancy if one circuit requires service.", "Ultra-low harmonic VFDs on compressors minimize electrical system harmonics while providing improved part-load efficiency and soft-start capability.", "FSNTL vibration isolation specified is appropriate for equipment installed outdoors on dunnage to prevent vibration transmission to the structure." ], "concerns": [ "Verify chiller location provides adequate clearance around the unit (minimum 6 feet on all sides) for proper airflow and maintenance access per manufacturer requirements.", "Ensure structural dunnage is designed for the 882.4 MCA electrical requirement and properly coordinated with dual point electrical connections.", "Verify sound levels are compatible with stadium environment, especially during events. Consider location relative to seating areas and possible need for additional sound attenuation.", "Confirm chiller maintenance access routes are adequate for future component replacement (e.g., motor or compressor).", "Ensure the BAS integration protocols are compatible with the existing stadium systems for seamless monitoring and control." ], "opportunities": [ "Consider adding cellular remote monitoring capability for real-time performance tracking and predictive maintenance.", "Explore possibility of demand-response programming to reduce energy costs during peak rate periods.", "Evaluate winter operation requirements and consider adding glycol if needed for freeze protection.", "Document baseline performance metrics at commissioning for future reference and performance verification.", "Consider equipment sound enclosures if noise levels are a concern for the stadium environment." ] } ], "buildVisionRecommendations": [ { "id": 1, "recommendation": "Conduct a thorough site survey to verify available space, clearances, and structural capacity for the chiller installation.", "rationale": "The York YVAA0456 air-cooled chiller requires significant clearance (minimum 6 feet on all sides) for proper airflow and service access. The structural support must also be adequate for the operating weight of approximately 22,000 lbs plus the weight of water and piping.", "estimatedImpact": "Prevents costly modifications during installation, ensures proper equipment operation and serviceability, and avoids potential airflow restrictions that could reduce capacity and efficiency.", "implementation": "Coordinate with the design team to verify site conditions, clearances, and structural capacity before finalizing equipment selection. Develop detailed installation plans that include service access requirements.", "priority": "High" }, { "id": 2, "recommendation": "Coordinate electrical requirements with a focus on dual point power connections and harmonics mitigation.", "rationale": "The specified chiller requires significant electrical capacity (MCA of 882.4 amps) with dual point power connections. Ultra-low harmonic VFDs require specific electrical coordination to ensure proper operation and compliance with IEEE-519 harmonic distortion limits.", "estimatedImpact": "Ensures proper electrical service without delays, prevents potential harmonic issues that could affect other stadium systems, and avoids costly electrical modifications during installation.", "implementation": "Work with electrical engineer to verify service capacity, coordinate breaker sizes and wiring requirements for dual point connections, and document harmonic mitigation strategy.", "priority": "High" }, { "id": 3, "recommendation": "Develop a detailed BAS integration plan that includes points list, control sequences, and communication protocols.", "rationale": "Modern chillers with advanced controls require proper integration with building automation systems for optimal operation. The chiller has robust onboard controls that need proper interface with the stadium's existing BAS.", "estimatedImpact": "Enables proactive monitoring, optimized system operation, improved energy efficiency, and facilitates remote troubleshooting capabilities.", "implementation": "Request detailed points list from manufacturer, coordinate with BAS contractor on communication protocols (BACnet, Modbus, etc.), and develop comprehensive control sequences for normal and emergency operation.", "priority": "Medium" }, { "id": 4, "recommendation": "Conduct a sound analysis and develop mitigation strategy if needed.", "rationale": "In a stadium environment, equipment noise could impact the fan experience during events. The York YVAA chiller produces approximately 85-90 dBA at 30 feet, which could be significant depending on proximity to occupied areas.", "estimatedImpact": "Prevents potential noise complaints, ensures compliance with local sound ordinances, and maintains optimal fan experience during stadium events.", "implementation": "Perform sound analysis based on equipment location relative to seating areas, evaluate need for additional sound attenuation measures, and implement appropriate solutions such as sound barriers or acoustic treatment.", "priority": "Medium" }, { "id": 5, "recommendation": "Develop a comprehensive commissioning and water treatment plan.", "rationale": "Proper commissioning and water treatment are critical for ensuring long-term reliability and efficiency of the chiller system. The integrated pump module requires specific commissioning procedures to ensure proper flow rates and system performance.", "estimatedImpact": "Extends equipment life, maintains efficiency, prevents premature component failure, and establishes performance baseline for future reference.", "implementation": "Engage manufacturer's startup technician, develop detailed commissioning plan that includes performance verification at various load conditions, and implement a comprehensive water treatment program specific to this application.", "priority": "Medium" } ], "conclusion": { "summary": "The specified York YVAA0456 air-cooled rotary screw chiller represents an excellent solution for the Citizens Bank Park Right Field Club application. With 350 tons of cooling capacity, high energy efficiency (1.05 kW/ton), and advanced features including ultra-low harmonic VFDs and an integrated pump module, this unit offers reliable performance with redundancy features appropriate for a high-profile venue. Several viable alternatives from reputable manufacturers exist in the New York/New Jersey market through established representatives, providing competitive options should they be needed. Proper attention to installation details, electrical coordination, sound considerations, and controls integration will ensure a successful implementation that meets the project's requirements for performance, reliability, and efficiency.", "keyFindings": [ "The basis of design York YVAA0456 chiller offers excellent energy efficiency (1.05 kW/ton) with environmentally-friendly R-513A refrigerant (GWP of 631).", "Redundancy is built into the system design with twin screw compressors (dual refrigerant circuits) and an integrated pump module with active/spare configuration.", "Ultra-low harmonic VFDs on both compressors provide superior part-load efficiency, soft-start capability, and reduced electrical harmonics.", "Several qualified alternatives are available from Trane, Carrier, Daikin, and Aermec through established New York area representatives.", "Specialized vibration isolation (FSNTL type) has been specified appropriately for the application to minimize structure-borne vibration and noise.", "Sound considerations are important for this stadium application and may require additional attenuation measures depending on equipment location relative to seating areas." ], "highestPriorityActions": [ "Conduct site survey to verify clearances, access requirements, and structural capacity for the chiller installation.", "Coordinate electrical requirements with particular attention to the dual point power connections and ultra-low harmonic VFD requirements.", "Develop detailed BAS integration plan with points list, communication protocols, and control sequences.", "Perform sound analysis and develop mitigation strategy if needed based on equipment location.", "Create comprehensive commissioning and water treatment plan to ensure optimal system performance and longevity." ] } }

